<?php

use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class AddProducts extends Migration {
//http://www.lnwmall.com/%E0%B9%80%E0%B8%AA%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%9C%E0%B9%89%E0%B8%B2%E0%B9%81%E0%B8%9F%E0%B8%8A%E0%B8%B1%E0%B9%88%E0%B8%99--c1
	/**
	 * Run the migrations.
	 *
	 * @return void
	 */
	public function up()
	{
		//women
		DB::table('products')->insert(array(
			'name' =>'เดรสครอปชีฟองจับกลีบกระโปรงชีฟองชมพู',
			'cost' =>'1000',
			'price' =>'1050',
			'description' =>'เสื้อทรงครอปชีฟองเนื้อทราย ดีเทลจับกลีบช่วงหน้าอก ซิปเย็บซ่อนด้านข้าง กระดุมติดด้านหลังลำคอ
กระโปรงด้านในผ้าซาตินสีชมพูสดใส ด้านนอกเย็บซ้อนด้วยผ้าแก้วเนื้อละเอียด เป็นผ้าแก้วเกรดพรีเมี่ยม
เนื้อนิ่ม เรียบสัมผัสลื่นมากค่ะการันตีคุณเนื้อผ้า เซ็ดนี้จะใส่แยกกันก็สวย ใส่ด้วยกันก็น่ารักลงตัวค่ะ งาน ***High Quality***
เสื้อ อก 32"/ เอว 28"/ความยาวเสื้อ 19"
กระโปรง เอว 26"/ความยาวกระโปรงจากเอว 28"',
			'weight' =>'45.5',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'5',
		));
		DB::table('products')->insert(array(
			'name' =>'เสื้อสูทH&M สีชมพู',
			'cost' =>'700',
			'price' =>'810',
			'description' =>'[พร้อมส่ง  MC-SG659 (51sango) 
++เสื้อสูท++H&Mงานเนี๊ยบ สีชมพูใส่สบาย มีกระเป๋าเป็นดีเทลด้านหน้าเก๋ๆ 
ใส่ได้ทั้ง indoor และ outdoor เลยคร่า ไหล่ 38 ซม. อก 92 ซม. ความยาว 51 ซม.',
			'weight' =>'30.5',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'7',
		));
		DB::table('products')->insert(array(
			'name' =>'ต่างหูมุกสีทองล้อมด้วยใบไม้ทอง',
			'cost' =>'200',
			'price' =>'330',
			'description' =>'ต่างหูมุกสีทอง ขนาด 2.3 x 1.8 ซ.ม ใบไม้กรอบทองเงางามในตัว
หรูหรา เหมาะใส่ไปทำงาน และ ออกงาน ',
			'weight' =>'5.5',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'4',
		));
		DB::table('products')->insert(array(
			'name' =>'ชุดเดรสยาวตัดเย็บด้วยผ้าซีฟอง',
			'cost' =>'700',
			'price' =>'990',
			'description' =>'ชุดเดรสยาวตัดเย็บด้วยผ้าซีฟองสวยเด่น กับดีไซน์สวยไม่ซ้ำใคร ที่จะใส่ในวันทำงาน 
หรือใส่ในวันงานสำคัญๆ ก็ดูหรูหรา สวยเด่นมากค่ะ ไซส์ M คะ ไหล่กว้าง 35CM, Bust 82CM, เอว 66-82CM ความยาว 122CM เอวยางยืด',
			'weight' =>'30.75',
			'size' =>'M',
			'sex' =>'F',
			'quantity' =>'8',
		));
		DB::table('products')->insert(array(
			'name' =>'Anna Sui Floral Crochet Maxi Dress',
			'cost' =>'700',
			'price' =>'990',
			'description' =>'ขนาดชุด : อก 34” l เอว ฟรีไซส์ใส่ได้ถึงเอว 33” l สะโพก 38” l
ยาว 49” (124 ซ.ม.) ซับในยาว 42” l รอบวงแขน 18”
แม็กซี่เดรสสวยคลาสสิค แพทเทิร์นแบรนด์ดัง Anna Sui
เนื้อผ้าผ้ายทอลายฉลุลูกไม้ ตัวนี้เป็นผ้าเชิงหน้ากว้าง ชายกระโปรงฉลุลายลูกไม่สวยน่ารัก
มาพร้อมเข็มขัดเข้าชุด จะใส่แบบปล่อยหรือคาดเข็มขัดก็สวยค่ะ
 ชุดมีซิปซ่อนด้านข้าง และมีซับในค่ะ
 
>> งานเกรด Premium quality คะ ป้าย Lady Ribbon นะคะ <<',
			'weight' =>'53.2',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'2',
		));
		DB::table('products')->insert(array(
			'name' =>'เดรสเกาะอก ตามด้วยโบว์ผ้าแก้ว (สีขาว)',
			'cost' =>'100',
			'price' =>'350',
			'description' =>'**เสื้อผ้านำเข้า**
เดรสเกาะอก สม๊อคหลัง พร้อมฟองน้ำเสริมทรง
โบว์ผ้าแก้ว สามารถแกะเอามาผูกอก ผูกคอ หรือผูกเอวได้คะ
ผ้าคอตตอน + สเปนเดก เนื้อผ้าทิ้งตัว ยืดหยุ่นดีคะ
Size : ยาว 24.5" อก 32-34" เอว 29"
สี ขาว',
			'weight' =>'77.5',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'5',
		));
		DB::table('products')->insert(array(
			'name' =>'เดรสชีฟองบางกระดุมหน้าพร้อมโบว์ผูก',
			'cost' =>'500',
			'price' =>'690',
			'description' =>'DR-0111 เดรสชีฟองบางกระดุมหน้าพร้อมโบว์ผูก
สี : ชมพู
ขนาด : Free size – ความยาวชุด 33.5 นิ้ว อก 34.5 นิ้ว เอว 32 นิ้ว',
			'weight' =>'63.5',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'10',
		));
		DB::table('products')->insert(array(
			'name' =>'เดรส2ชิ้น ลายดอกไม้',
			'cost' =>'150',
			'price' =>'333',
			'description' =>'No Description',
			'weight' =>'35.7',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'4',
		));
		DB::table('products')->insert(array(
			'name' =>'เสื้อกันหนาวมิกกี้เมาท์สีเทาดำ',
			'cost' =>'500',
			'price' =>'720',
			'description' =>'พร้อมส่ง  (ymini) - รหัส MC1524 เสื้อกันหนาวมิกกี้เมาท์สีเทาดำ ตัวกว้างน่ารักมากใส่อุ่นๆอากาศเย็นๆ น่ารักสุดๆคะ
ความยาว: 78 หน้าอก: 115  แขน: 67 CM',
			'weight' =>'50.0',
			'size' =>'S',
			'sex' =>'F',
			'quantity' =>'9',
		));
		DB::table('products')->insert(array(
			'name' =>'Lady Lesslie Sweet Shinori Houdstooth Tweed Dress',
			'cost' =>'300',
			'price' =>'490',
			'description' =>'ขนาด M :  36” l เอว 31” l สะโพก 38” l วงแขน 18” l ยาว 31”
เดรสสไตล์ออฟฟิส ใส่ไปทำงานเก๋ๆ ทรงแบบเรียบเข้ารูป
เนื้อผ้าทวีดลายฮาวด์สทูธ  (ชิโนริ) แบบสาว CHANEL  ช่วงอกผ่าลงมาประมาณ 3 นิ้ว
เนื้อผ้า Tweed 100% ทอลายละเอียดสวย ไม่หนา ใส่สบายคะ บุซับในทั้งตัว ซิปซ่อนด้านหลัง
>> งานเกรด Premium quality คะ ป้าย Lady Ribbon นะคะ <<',
			'weight' =>'27.5',
			'size' =>'M',
			'sex' =>'F',
			'quantity' =>'12',
		));

//men
		DB::table('products')->insert(array(
			'name' =>'แจ็กเก็ต สีดำ ลายจุด',
			'cost' =>'300',
			'price' =>'580',
			'description' =>'แจ็กเก็ต สีดำ ลายจุด พร้อมส่ง
แขนยาว ซิปหน้า  ใส่ได้ทั้งชาย, หญิง ใส่คู่กันเป็นเสื้อคู่รัก
ความยาว 65, รอบอก 106-110 , เอว 86-110 , ไหล่ 45 , แขนยาว 58 ,เส้นรอบวงปลายแขน 16-24',
			'weight' =>'17.0',
			'size' =>'L',
			'sex' =>'M',
			'quantity' =>'20',
		));
		DB::table('products')->insert(array(
			'name' =>'แจ็กเก็ตเบสบอล สีน้ำเงิน ลาย FM ',
			'cost' =>'300',
			'price' =>'580',
			'description' =>'แจ็กเก็ตเบสบอล สีน้ำเงิน ลาย FM พร้อมส่ง 
ตัวเสื้อสีน้ำเงิน แขนสีขาว ติดกระดุมหน้า
ใส่ได้ทั้งชาย, หญิง ใส่คู่กันเป็นเสื้อคู่รัก
ผ้ายืด ด้านในเป็นผ้าสักหลาด ใส่กันหนาวได้ดี
ความยาว 65, รอบอก 106-110 , เอว 86-110 , ไหล่ 45 , แขนยาว 58 ,เส้นรอบวงปลายแขน 16-24',
			'weight' =>'11.0',
			'size' =>'L',
			'sex' =>'M',
			'quantity' =>'15',
		));
		DB::table('products')->insert(array(
			'name' =>'เสื้อเชิ๊ตผ้าฝ้ายแขนสั้น',
			'cost' =>'200',
			'price' =>'450',
			'description' =>'P-0338 เสื้อเชิ๊ตผ้าฝ้ายแขนสั้น
ความยาว 27 นิ้ว ไหล่ 17.5 นิ้ว อก 39.5 นิ้ว',
			'weight' =>'20.5',
			'size' =>'XL',
			'sex' =>'M',
			'quantity' =>'5',
		));
		DB::table('products')->insert(array(
			'name' =>'แจ็กเก็ตเบสบอล สีน้ำเงิน ลาย R ',
			'cost' =>'400',
			'price' =>'580',
			'description' =>'แจ็กเก็ตเบสบอล สีดำ ลาย R พร้อมส่ง 
ตัวเสื้อสีดำ แขนสีขาว ติดกระดุมหน้า
ใส่ได้ทั้งชาย, หญิง ใส่คู่กันเป็นเสื้อคู่รัก
ผ้ายืด ด้านในเป็นผ้าสักหลาด ใส่กันหนาวได้ดี
ความยาว 62, รอบอก 86-95 , เอว 80-95 ,ไหล่ 39 , แขนยาว 58 ,เส้นรอบวงปลายแขน 16-24',
			'weight' =>'10.75',
			'size' =>'M',
			'sex' =>'M',
			'quantity' =>'7',
		));
		DB::table('products')->insert(array(
			'name' =>'แจ็กเก็ตกันหนาว มีฮู๊ด',
			'cost' =>'300',
			'price' =>'580',
			'description' =>'แจ็กเก็ตกันหนาว มีฮู๊ด ซิปหน้า ใส่ได้ทั้งชาย, หญิง  
ผ้ายืด ด้านในเป็นผ้าสักหลาด ใส่กันหนาวได้ดี
ความยาวไม่รวมฮู๊ด 65, รอบอก 106-110 , เอว 86-110 , ไหล่ 45 , แขนยาว 58 ,เส้นรอบวงปลายแขน 16-24',
			'weight' =>'11.25',
			'size' =>'L',
			'sex' =>'M',
			'quantity' =>'14',
		));
		DB::table('products')->insert(array(
			'name' =>'กางเกงขาสั้นผู้ชาย เนื้อผ้าชุดว่ายน้ำ ',
			'cost' =>'400',
			'price' =>'650',
			'description' =>'[พร้อมส่ง]BeachMan-00904  กางเกงขาสั้นผู้ชาย เนื้อผ้าชุดว่ายน้ำ ใส่ลงเล่นน้ำในสระว่ายน้ำได้ฟรีไซส์คะ
เอวยืดได้ ฟรีไซส์คะ
เอวกางเกงก่อนดึงยืด ประมาณ 28 นิ้ว
เอวเป็นยางยืด  ลองดึงยืดแบบสุดๆๆเลยจะได้ประมาณ 40 - 50  นิ้วค่ะ
เอวกางเกงเป็นแบบยางยืด มีเชือกผูก',
			'weight' =>'18.35',
			'size' =>'3XL',
			'sex' =>'M',
			'quantity' =>'17',
		));
		DB::table('products')->insert(array(
			'name' =>'แจ็กเก็ตเบสบอล สีแดง ลาย FM ',
			'cost' =>'400',
			'price' =>'580',
			'description' =>'แจ็กเก็ตเบสบอล สีแดง ลาย FM พร้อมส่ง 
ตัวเสื้อสีแดง แขนสีขาว ติดกระดุมหน้า
ใส่ได้ทั้งชาย, หญิง ใส่คู่กันเป็นเสื้อคู่รัก
ผ้ายืด ด้านในเป็นผ้าสักหลาด ใส่กันหนาวได้ดี
ความยาว 62, รอบอก 86-95 , เอว 80-95 ,ไหล่ 39 , แขนยาว 58 ,เส้นรอบวงปลายแขน 16-24',
			'weight' =>'16.45',
			'size' =>'M',
			'sex' =>'M',
			'quantity' =>'16',
		));
		DB::table('products')->insert(array(
			'name' =>'เสื้อยืดผ้าฝ้ายพิมพ์ลายหน้าหลัง',
			'cost' =>'200',
			'price' =>'390',
			'description' =>'ความยาว 26.5 นิ้ว ไหล่ 17 นิ้ว อก 39.5 นิ้ว',
			'weight' =>'19.75',
			'size' =>'L',
			'sex' =>'M',
			'quantity' =>'1',
		));
		DB::table('products')->insert(array(
			'name' =>'แจ็กเก็ตเบสบอล สีเทา ลายดาว ',
			'cost' =>'300',
			'price' =>'580',
			'description' =>'แจ็กเก็ตเบสบอล สีเทา ลายดาว พร้อมส่ง 
ตัวเสื้อเทา แขนสีขาว ติดกระดุมหน้า มีฮู๊ด
ใส่ได้ทั้งชาย, หญิง ใส่คู่กันเป็นเสื้อคู่รัก
ผ้ายืด ด้านในเป็นผ้าสักหลาด ใส่กันหนาวได้ดี
ความยาวไม่รวมฮู๊ด 62, รอบอก 86-95 , เอว 80-95 ,ไหล่ 39 , แขนยาว 58 ,เส้นรอบวงปลายแขน 16-24',
			'weight' =>'16.3',
			'size' =>'M',
			'sex' =>'M',
			'quantity' =>'5',
		));
		DB::table('products')->insert(array(
			'name' =>'แจ็กเก็ตเบสบอล สีฟ้า ลายซูเปอร์แมน ',
			'cost' =>'300',
			'price' =>'580',
			'description' =>'แจ็กเก็ตเบสบอล สีฟ้า ลายซูเปอร์แมน พร้อมส่ง 
ตัวเสื้อสีฟ้า แขนสีขาว ติดกระดุมหน้า
ใส่ได้ทั้งชาย, หญิง ใส่คู่กันเป็นเสื้อคู่รัก
ผ้ายืด ด้านในเป็นผ้าสักหลาด ใส่กันหนาวได้ดี
ความยาว 62, รอบอก 86-95 , เอว 80-95 ,ไหล่ 39 , แขนยาว 58 ,เส้นรอบวงปลายแขน 16-24',
			'weight' =>'13.5',
			'size' =>'M',
			'sex' =>'M',
			'quantity' =>'3',
		));
	}

	/**
	 * Reverse the migrations.
	 *
	 * @return void
	 */
	public function down()
	{
		//
	}

}
